enyyaalark/px4-dual-motor-rpm-sync/firmware/stm32/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HALL1_CAPTURE_Pin GPIO_PIN_0
#define HALL1_CAPTURE_GPIO_Port GPIOA
#define HALL2_CAPTURE_Pin GPIO_PIN_1
#define HALL2_CAPTURE_GPIO_Port GPIOA
#define PX4_PWM1_CAPTURE_Pin GPIO_PIN_6
#define PX4_PWM1_CAPTURE_GPIO_Port GPIOA
#define PX4_PWM2_CAPTURE_Pin GPIO_PIN_6
#define PX4_PWM2_CAPTURE_GPIO_Port GPIOB
#define STATUS_LED_Pin GPIO_PIN_6
#define STATUS_LED_GPIO_Port GPIOC
#define ESC1_PWM_OUT_Pin GPIO_PIN_8
#define ESC1_PWM_OUT_GPIO_Port GPIOA
#define TELEMETRY_TX_Pin GPIO_PIN_9
#define TELEMETRY_TX_GPIO_Port GPIOA
#define ESC2_PWM_OUT_Pin GPIO_PIN_10
#define ESC2_PWM_OUT_GPIO_Port GPIOA
#define TELEMETRY_RX_UNUSED_Pin GPIO_PIN_7
#define TELEMETRY_RX_UNUSED_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
